[Killed] ConditionalExpression
src/main/pages/ProfilePage.js:12:7
 
   const currentUser = (user || currentUserFromHook)
   console.log("currentUser: ", currentUser);
-  if (!currentUser.loggedIn) {
+  if (false) {
     return <p>Not logged in.</p>;
   }
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: TypeError: Cannot read properties of null (reading 'user')

[Killed] ConditionalExpression
src/main/pages/ProfilePage.js:12:7
 
   const currentUser = (user || currentUserFromHook)
   console.log("currentUser: ", currentUser);
-  if (!currentUser.loggedIn) {
+  if (true) {
     return <p>Not logged in.</p>;
   }
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: Unable to find an element with the text: Phillip Conrad. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <p>
      Not logged in.
    </p>
  </div>

[Killed] StringLiteral
src/main/pages/ProfilePage.js:31:28
         <Col md>
           <h2>{fullName}</h2>
           {/* FUTURE: Pronouns go here, if pronoun field is null, add endpoint for user to modify*/}
-          <RoleBadge role={"ROLE_USER"} currentUser={currentUser} />
+          <RoleBadge role={""} currentUser={currentUser} />
           <RoleBadge role={"ROLE_MEMBER"} currentUser={currentUser} />
           <RoleBadge role={"ROLE_ADMIN"} currentUser={currentUser} />
killedBy: ProfilePage tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="role-badge-user"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
src/main/pages/ProfilePage.js:45:46
             <p>{email}</p>
             <h4>Admin Status:</h4>
             <p>
-              {currentUser.root.user.admin ? "Active Admin" : "Not an Admin"}
+              {currentUser.root.user.admin ? "" : "Not an Admin"}
             </p>
             <h4>Rider Status:</h4>
killedBy: ProfilePage tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Active Admin. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
src/main/pages/ProfilePage.js:45:63
             <p>{email}</p>
             <h4>Admin Status:</h4>
             <p>
-              {currentUser.root.user.admin ? "Active Admin" : "Not an Admin"}
+              {currentUser.root.user.admin ? "Active Admin" : ""}
             </p>
             <h4>Rider Status:</h4>
killedBy: ProfilePage tests renders correctly for Rider user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Not an Admin. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
src/main/pages/ProfilePage.js:50:34
             <h4>Rider Status:</h4>
             <p>
             {currentUser.root.user.rider
-              ? "Active Rider" : "Not a Rider"}
+              ? "Active Rider" : ""}
             </p>
             <h4>Driver Status:</h4>
killedBy: ProfilePage tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Not a Rider. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
