[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:54:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Ride" id="appnavbar-rides-dropdown" data-testid="appnavbar-rides-dropdown" >
-                    <NavDropdown.Item href="/rides/create">Ride Request</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                true
               }
             </Nav>
killedBy: AppNavbar tests renders the Ride menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-rides-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:54:17
 
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Ride" id="appnavbar-rides-dropdown" data-testid="appnavbar-rides-dropdown" >
-                    <NavDropdown.Item href="/rides/create">Ride Request</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                hasRole(currentUser, "ROLE_USER") || <NavDropdown title="Ride" id="appnavbar-rides-dropdown" data-testid="appnavbar-rides-dropdown">
+                    <NavDropdown.Item href="/rides/create">Ride Request</NavDropdown.Item>
+                  </NavDropdown>
               }
             </Nav>
killedBy: AppNavbar tests renders the Ride menu correctly for a user
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-rides-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"
    >
