[Killed] BlockStatement
main/components/Users/UsersTable.js:8:49
 
 
 export default function UsersTable({ users}) {
-    function cellToAxiosParamsToggleRider(cell) {
-        return {
-            url: "/api/admin/users/toggleRider",
-            method: "POST",
-            params: {
-                id: cell.row.values.id
-            }
-        }
-    }
+    function cellToAxiosParamsToggleRider(cell) {}
     // Stryker disable all : hard to test for query caching
     const toggleRiderMutation = useBackendMutation(
killedBy: AdminUsersPage tests usertable toggle rider tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/components/Users/UsersTable.js:9:16
 
 export default function UsersTable({ users}) {
     function cellToAxiosParamsToggleRider(cell) {
-        return {
-            url: "/api/admin/users/toggleRider",
-            method: "POST",
-            params: {
-                id: cell.row.values.id
-            }
-        }
+        return {}
     }
     // Stryker disable all : hard to test for query caching
killedBy: AdminUsersPage tests usertable toggle rider tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/components/Users/UsersTable.js:11:21
     function cellToAxiosParamsToggleRider(cell) {
         return {
             url: "/api/admin/users/toggleRider",
-            method: "POST",
+            method: "",
             params: {
                 id: cell.row.values.id
killedBy: AdminUsersPage tests usertable toggle rider tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
