[Killed] StringLiteral
src/main/pages/HomePage.js:7:89
   return (
     <BasicLayout>
       <div className="pt-2">
-        <img data-testid="UCSBLogo" src="UCSBLogo.png" style={{width: "150px", display: "inline-block", verticalAlign: "middle", margin:"0px 20px"}} alt="UCSB Logo"></img>
+        <img data-testid="UCSBLogo" src="UCSBLogo.png" style={{width: "150px", display: "", verticalAlign: "middle", margin:"0px 20px"}} alt="UCSB Logo"></img>
         <h1 data-testid="header" style={{display: "inline-block", verticalAlign:"middle"}}>Gauchoride</h1>
 
killedBy: HomePage tests home page styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- display: inline-block;

[Killed] ObjectLiteral
src/main/pages/HomePage.js:7:63
   return (
     <BasicLayout>
       <div className="pt-2">
-        <img data-testid="UCSBLogo" src="UCSBLogo.png" style={{width: "150px", display: "inline-block", verticalAlign: "middle", margin:"0px 20px"}} alt="UCSB Logo"></img>
+        <img data-testid="UCSBLogo" src="UCSBLogo.png" style={{}} alt="UCSB Logo"></img>
         <h1 data-testid="header" style={{display: "inline-block", verticalAlign:"middle"}}>Gauchoride</h1>
 
killedBy: HomePage tests home page styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- width: 150px;

[Killed] ObjectLiteral
src/main/pages/HomePage.js:8:41
     <BasicLayout>
       <div className="pt-2">
         <img data-testid="UCSBLogo" src="UCSBLogo.png" style={{width: "150px", display: "inline-block", verticalAlign: "middle", margin:"0px 20px"}} alt="UCSB Logo"></img>
-        <h1 data-testid="header" style={{display: "inline-block", verticalAlign:"middle"}}>Gauchoride</h1>
+        <h1 data-testid="header" style={{}}>Gauchoride</h1>
 
         <div data-testid="container" style={{margin:"0px 20px", backgroundColor:"#f5f5f5", padding: "20px"}}>
killedBy: HomePage tests home page styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- display: inline-block;
+ display: block;

[Killed] StringLiteral
src/main/pages/HomePage.js:10:101
         <img data-testid="UCSBLogo" src="UCSBLogo.png" style={{width: "150px", display: "inline-block", verticalAlign: "middle", margin:"0px 20px"}} alt="UCSB Logo"></img>
         <h1 data-testid="header" style={{display: "inline-block", verticalAlign:"middle"}}>Gauchoride</h1>
 
-        <div data-testid="container" style={{margin:"0px 20px", backgroundColor:"#f5f5f5", padding: "20px"}}>
+        <div data-testid="container" style={{margin:"0px 20px", backgroundColor:"#f5f5f5", padding: ""}}>
           <h3>
             About this application
killedBy: HomePage tests home page styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- padding: 20px;

[Killed] StringLiteral
src/main/pages/HomePage.js:10:81
         <img data-testid="UCSBLogo" src="UCSBLogo.png" style={{width: "150px", display: "inline-block", verticalAlign: "middle", margin:"0px 20px"}} alt="UCSB Logo"></img>
         <h1 data-testid="header" style={{display: "inline-block", verticalAlign:"middle"}}>Gauchoride</h1>
 
-        <div data-testid="container" style={{margin:"0px 20px", backgroundColor:"#f5f5f5", padding: "20px"}}>
+        <div data-testid="container" style={{margin:"0px 20px", backgroundColor:"", padding: "20px"}}>
           <h3>
             About this application
killedBy: HomePage tests home page styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: rgb(245, 245, 245);
