[Killed] ConditionalExpression
src/main/pages/ProfilePage.js:10:24
 const ProfilePage = ({user}) => {
   const { data: currentUserFromHook } = useCurrentUser();
 
-  const currentUser = (user || currentUserFromHook)
+  const currentUser = (false)
   if (!currentUser.loggedIn) {
     return <p>Not logged in.</p>;
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: Unable to find an element with the text: Phillip Conrad. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <p>
      Not logged in.
    </p>
  </div>

[Killed] ConditionalExpression
src/main/pages/ProfilePage.js:10:24
 const ProfilePage = ({user}) => {
   const { data: currentUserFromHook } = useCurrentUser();
 
-  const currentUser = (user || currentUserFromHook)
+  const currentUser = (true)
   if (!currentUser.loggedIn) {
     return <p>Not logged in.</p>;
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: Unable to find an element with the text: Phillip Conrad. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <p>
      Not logged in.
    </p>
  </div>

[Killed] BooleanLiteral
src/main/pages/ProfilePage.js:11:7
   const { data: currentUserFromHook } = useCurrentUser();
 
   const currentUser = (user || currentUserFromHook)
-  if (!currentUser.loggedIn) {
+  if (currentUser.loggedIn) {
     return <p>Not logged in.</p>;
   }
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: TypeError: Cannot read properties of null (reading 'user')

[Killed] ConditionalExpression
src/main/pages/ProfilePage.js:11:7
   const { data: currentUserFromHook } = useCurrentUser();
 
   const currentUser = (user || currentUserFromHook)
-  if (!currentUser.loggedIn) {
+  if (true) {
     return <p>Not logged in.</p>;
   }
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: Unable to find an element with the text: Phillip Conrad. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <p>
      Not logged in.
    </p>
  </div>

[Killed] StringLiteral
src/main/pages/ProfilePage.js:52:48
               ? "Active Rider" : "Not a Rider"}
             </p>
             <h4>Driver Status:</h4>
-            <p>{currentUser.root.user.driver ? "Active Driver" : "Not a Driver" }</p>
+            <p>{currentUser.root.user.driver ? "" : "Not a Driver" }</p>
 
             {/*FUTURE: Include Wheelchair status in this page. Add toggle functionality*/}
killedBy: ProfilePage tests renders correctly for Driver user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Active Driver. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
