[Killed] ArrowFunction
main/pages/Rider/RiderCreatePage.js:14:31
   
 
 
-  const objectToAxiosParams = (ride) => ({
-    url: "/api/riders/post",
-    method: "POST",
-    params: {
-      riderId: rider.root.user.id,
-      day: ride.day,
-      startTime: ride.startTime,
-      endTime: ride.endTime,
-      pickupLocation:ride.pickupLocation,
-      dropoffLocation: ride.dropoffLocation
-      
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (ride) => {
killedBy: RiderCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/Rider/RiderCreatePage.js:28:31
     }
   });
 
-  const onSuccess = (ride) => {
-    toast(`New Ride Created - id: ${ride.id} riderId: ${rider.root.user.id}`);
-  }
+  const onSuccess = (ride) => {}
 
   const mutation = useBackendMutation(
killedBy: RiderCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Ride Created - id: 17 riderId: 2"

Number of calls: 0

[Killed] BlockStatement
main/pages/Rider/RiderCreatePage.js:41:36
 
   const { isSuccess } = mutation
 
-  const onSubmit = async (data) => {
-    mutation.mutate(data)
-  };
+  const onSubmit = async (data) => {};
   
 
killedBy: RiderCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
