[Killed] BlockStatement
main/components/Users/UsersTable.js:51:50
     
     // ---------------------------------------------------------------------------------------------
 
-    function cellToAxiosParamsToggleDriver(cell) {
-        return {
-            url: "/api/admin/users/toggleDriver",
-            method: "POST",
-            params: {
-                id: cell.row.values.id
-            }
-        }
-    }
+    function cellToAxiosParamsToggleDriver(cell) {}
 
     // Stryker disable all : hard to test for query caching
killedBy: AdminUsersPage tests usertable toggle driver tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/components/Users/UsersTable.js:53:18
 
     function cellToAxiosParamsToggleDriver(cell) {
         return {
-            url: "/api/admin/users/toggleDriver",
+            url: "",
             method: "POST",
             params: {
killedBy: AdminUsersPage tests usertable toggle driver tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/api/admin/users/toggleDriver"
Received: ""

[Killed] StringLiteral
main/components/Users/UsersTable.js:54:21
     function cellToAxiosParamsToggleDriver(cell) {
         return {
             url: "/api/admin/users/toggleDriver",
-            method: "POST",
+            method: "",
             params: {
                 id: cell.row.values.id
killedBy: AdminUsersPage tests usertable toggle driver tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/components/Users/UsersTable.js:96:9
             id: 'admin',
             accessor: (row, _rowIndex) => String(row.admin) // hack needed for boolean values to show up
         },
-        {
-            Header: 'Driver',
-            id: 'driver',
-            accessor: (row, _rowIndex) => String(row.driver) // hack needed for boolean values to show up
-        },
+        {},
         {
             Header: 'Rider',
killedBy: UserTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Users/UsersTable.js:102:21
             accessor: (row, _rowIndex) => String(row.driver) // hack needed for boolean values to show up
         },
         {
-            Header: 'Rider',
+            Header: "",
             id: 'rider',
             accessor: (row, _rowIndex) => String(row.rider) // hack needed for boolean values to show up
killedBy: UserTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Rider. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Users/UsersTable.js:112:39
         ...columns,
         ButtonColumn("toggle-admin", "primary", toggleAdminCallback, "UsersTable"),
 
-        ButtonColumn("toggle-driver", "primary", toggleDriverCallback, "UsersTable"),
+        ButtonColumn("toggle-driver", "", toggleDriverCallback, "UsersTable"),
 
         ButtonColumn("toggle-rider", "primary", toggleRiderCallback, "UsersTable")
killedBy: UserTable tests Has the expected colum headers and content
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/Users/UsersTable.js:112:22
         ...columns,
         ButtonColumn("toggle-admin", "primary", toggleAdminCallback, "UsersTable"),
 
-        ButtonColumn("toggle-driver", "primary", toggleDriverCallback, "UsersTable"),
+        ButtonColumn("", "primary", toggleDriverCallback, "UsersTable"),
 
         ButtonColumn("toggle-rider", "primary", toggleRiderCallback, "UsersTable")
killedBy: UserTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Users/UsersTable.js:114:22
 
         ButtonColumn("toggle-driver", "primary", toggleDriverCallback, "UsersTable"),
 
-        ButtonColumn("toggle-rider", "primary", toggleRiderCallback, "UsersTable")
+        ButtonColumn("", "primary", toggleRiderCallback, "UsersTable")
 
         
killedBy: UserTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Users/UsersTable.js:114:38
 
         ButtonColumn("toggle-driver", "primary", toggleDriverCallback, "UsersTable"),
 
-        ButtonColumn("toggle-rider", "primary", toggleRiderCallback, "UsersTable")
+        ButtonColumn("toggle-rider", "", toggleRiderCallback, "UsersTable")
 
         
killedBy: UserTable tests Has the expected colum headers and content
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn
