[Killed] BooleanLiteral
src/main/pages/AdminUsersPage.js:17:54
             { method: "GET", url: "/api/admin/users" },
             []
         );
-    const [isCheckedAll, setIsCheckedAll] = useState(true);
+    const [isCheckedAll, setIsCheckedAll] = useState(false);
     const [isCheckedDrivers, setIsCheckedDrivers] = useState(false);
     const [isCheckedRiders, setIsCheckedRiders] = useState(false);
killedBy: AdminUsersPage tests usertable toggle admin tests
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-toggle-admin-button"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BooleanLiteral
src/main/pages/AdminUsersPage.js:18:62
             []
         );
     const [isCheckedAll, setIsCheckedAll] = useState(true);
-    const [isCheckedDrivers, setIsCheckedDrivers] = useState(false);
+    const [isCheckedDrivers, setIsCheckedDrivers] = useState(true);
     const [isCheckedRiders, setIsCheckedRiders] = useState(false);
     const handleOnChangeAll = () => {
killedBy: AdminUsersPage tests Tests All->Drivers->All
statusReason: Error: expect(element).not.toBeChecked()

Received element is checked:
  <input checked="" id="drivers" name="drivers" type="checkbox" value="Drivers" />

[Killed] BooleanLiteral
src/main/pages/AdminUsersPage.js:19:60
         );
     const [isCheckedAll, setIsCheckedAll] = useState(true);
     const [isCheckedDrivers, setIsCheckedDrivers] = useState(false);
-    const [isCheckedRiders, setIsCheckedRiders] = useState(false);
+    const [isCheckedRiders, setIsCheckedRiders] = useState(true);
     const handleOnChangeAll = () => {
       setIsCheckedAll(true);
killedBy: AdminUsersPage tests Tests All->Drivers->All
statusReason: Error: expect(element).not.toBeChecked()

Received element is checked:
  <input checked="" id="riders" name="riders" type="checkbox" value="Riders" />

[Killed] BlockStatement
src/main/pages/AdminUsersPage.js:20:37
     const [isCheckedAll, setIsCheckedAll] = useState(true);
     const [isCheckedDrivers, setIsCheckedDrivers] = useState(false);
     const [isCheckedRiders, setIsCheckedRiders] = useState(false);
-    const handleOnChangeAll = () => {
-      setIsCheckedAll(true);
-      setIsCheckedDrivers(false);
-      setIsCheckedRiders(false);
-    };
+    const handleOnChangeAll = () => {};
     const handleOnChangeDrivers = () => {
         setIsCheckedDrivers(true);
killedBy: AdminUsersPage tests Tests All->Drivers->All
statusReason: Error: expect(element).toBeChecked()

Received element is not checked:
  <input checked="" id="all" name="all" type="checkbox" value="All" />

[Killed] BooleanLiteral
src/main/pages/AdminUsersPage.js:21:23
     const [isCheckedDrivers, setIsCheckedDrivers] = useState(false);
     const [isCheckedRiders, setIsCheckedRiders] = useState(false);
     const handleOnChangeAll = () => {
-      setIsCheckedAll(true);
+      setIsCheckedAll(false);
       setIsCheckedDrivers(false);
       setIsCheckedRiders(false);
killedBy: AdminUsersPage tests Tests All->Drivers->All
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Phill
Received:
  Craig

[Killed] BooleanLiteral
src/main/pages/AdminUsersPage.js:22:27
     const [isCheckedRiders, setIsCheckedRiders] = useState(false);
     const handleOnChangeAll = () => {
       setIsCheckedAll(true);
-      setIsCheckedDrivers(false);
+      setIsCheckedDrivers(true);
       setIsCheckedRiders(false);
     };
killedBy: AdminUsersPage tests Tests All->Riders->All Filter
statusReason: Error: expect(element).not.toBeChecked()

Received element is checked:
  <input id="drivers" name="drivers" type="checkbox" value="Drivers" />

[Killed] BooleanLiteral
src/main/pages/AdminUsersPage.js:23:26
     const handleOnChangeAll = () => {
       setIsCheckedAll(true);
       setIsCheckedDrivers(false);
-      setIsCheckedRiders(false);
+      setIsCheckedRiders(true);
     };
     const handleOnChangeDrivers = () => {
killedBy: AdminUsersPage tests Tests All->Drivers->All
statusReason: Error: expect(element).not.toBeChecked()

Received element is checked:
  <input id="riders" name="riders" type="checkbox" value="Riders" />

[Killed] BlockStatement
src/main/pages/AdminUsersPage.js:25:41
       setIsCheckedDrivers(false);
       setIsCheckedRiders(false);
     };
-    const handleOnChangeDrivers = () => {
-        setIsCheckedDrivers(true);
-        setIsCheckedAll(false);
-        setIsCheckedRiders(false);
-      };
+    const handleOnChangeDrivers = () => {};
     const handleOnChangeRiders = () => {
         setIsCheckedRiders(true);
killedBy: AdminUsersPage tests Tests All->Drivers->All
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Phillip
Received:
  Phill

[Killed] BooleanLiteral
src/main/pages/AdminUsersPage.js:26:29
       setIsCheckedRiders(false);
     };
     const handleOnChangeDrivers = () => {
-        setIsCheckedDrivers(true);
+        setIsCheckedDrivers(false);
         setIsCheckedAll(false);
         setIsCheckedRiders(false);
killedBy: AdminUsersPage tests Tests All->Drivers->All
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Phillip
Received:
  Craig

[Killed] BooleanLiteral
src/main/pages/AdminUsersPage.js:27:25
     };
     const handleOnChangeDrivers = () => {
         setIsCheckedDrivers(true);
-        setIsCheckedAll(false);
+        setIsCheckedAll(true);
         setIsCheckedRiders(false);
       };
killedBy: AdminUsersPage tests Tests All->Drivers->All
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Phillip
Received:
  Phill

[Killed] BooleanLiteral
src/main/pages/AdminUsersPage.js:28:28
     const handleOnChangeDrivers = () => {
         setIsCheckedDrivers(true);
         setIsCheckedAll(false);
-        setIsCheckedRiders(false);
+        setIsCheckedRiders(true);
       };
     const handleOnChangeRiders = () => {
killedBy: AdminUsersPage tests Tests All->Riders->Drivers Filter
statusReason: Error: expect(element).not.toBeChecked()

Received element is checked:
  <input id="riders" name="riders" type="checkbox" value="Riders" />

[Killed] BlockStatement
src/main/pages/AdminUsersPage.js:30:40
         setIsCheckedAll(false);
         setIsCheckedRiders(false);
       };
-    const handleOnChangeRiders = () => {
-        setIsCheckedRiders(true);
-        setIsCheckedAll(false);
-        setIsCheckedDrivers(false);
-    };
+    const handleOnChangeRiders = () => {};
 
 
killedBy: AdminUsersPage tests Tests All->Riders
statusReason: Error: expect(element).not.toBeChecked()

Received element is checked:
  <input checked="" id="all" name="all" type="checkbox" value="All" />

[Killed] BooleanLiteral
src/main/pages/AdminUsersPage.js:31:28
         setIsCheckedRiders(false);
       };
     const handleOnChangeRiders = () => {
-        setIsCheckedRiders(true);
+        setIsCheckedRiders(false);
         setIsCheckedAll(false);
         setIsCheckedDrivers(false);
killedBy: AdminUsersPage tests Tests All->Riders
statusReason: Error: expect(element).toBeChecked()

Received element is not checked:
  <input id="riders" name="riders" type="checkbox" value="Riders" />

[Killed] BooleanLiteral
src/main/pages/AdminUsersPage.js:32:25
       };
     const handleOnChangeRiders = () => {
         setIsCheckedRiders(true);
-        setIsCheckedAll(false);
+        setIsCheckedAll(true);
         setIsCheckedDrivers(false);
     };
killedBy: AdminUsersPage tests Tests All->Riders
statusReason: Error: expect(element).not.toBeChecked()

Received element is checked:
  <input checked="" id="all" name="all" type="checkbox" value="All" />

[Killed] BooleanLiteral
src/main/pages/AdminUsersPage.js:33:29
     const handleOnChangeRiders = () => {
         setIsCheckedRiders(true);
         setIsCheckedAll(false);
-        setIsCheckedDrivers(false);
+        setIsCheckedDrivers(true);
     };
 
killedBy: AdminUsersPage tests Tests All->Riders
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Craig
Received:
  Phillip
