[Killed] ArrowFunction
main/pages/Ride/RideCreatePage.js:11:31
 export default function RideCreatePage() {
 
 
-  const objectToAxiosParams = (ride) => ({
-    url: "/api/rides/post",
-    method: "POST",
-    params: {
-      day: ride.day,
-      startTime: ride.startTime,
-      endTime: ride.endTime,
-      pickupLocation:ride.pickupLocation,
-      dropoffLocation: ride.dropoffLocation
-
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (ride) => {
killedBy: RideCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Ride/RideCreatePage.js:12:10
 
 
   const objectToAxiosParams = (ride) => ({
-    url: "/api/rides/post",
+    url: "",
     method: "POST",
     params: {
killedBy: RideCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Ride Created - id: 17"

Number of calls: 0

[Killed] StringLiteral
main/pages/Ride/RideCreatePage.js:13:13
 
   const objectToAxiosParams = (ride) => ({
     url: "/api/rides/post",
-    method: "POST",
+    method: "",
     params: {
       day: ride.day,
killedBy: RideCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
